In [1]:
import pandas as pd

In [6]:
pd.read_excel("dane/wiele_arkuszy.xlsx", sheet_name='Arkusz1')

  kol1  kol2             kol3
0    a     1      ala ma kota
1    b     2      olek ma psa
2    c     3  zuzia jest sama

In [7]:
data = {'Imie': ['Anna', 'Marcin', None, 'Julia'],
        'Wiek': [28, None, 35, 22]}
df = pd.DataFrame(data)
df

     Imie  Wiek
0    Anna  28.0
1  Marcin   NaN
2    None  35.0
3   Julia  22.0

In [8]:
df.to_excel("dane/wiele_arkuszy.xlsx", index=False, sheet_name='Nowy_arkusz_1')

In [9]:
df_b = pd.DataFrame({
    'Imie': ['Jan', 'Anna', 'Piotr', 'Maria', 'Krzysztof'],
    'Wiek': [28, 34, 26, 40, 22],
    'Miasto': ['Warszawa', 'Kraków', 'Gdańsk', 'Warszawa', 'Poznań'],
    'Pensja': [5000, 6200, 4800, 5200, 4500]
})
df_b

        Imie  Wiek    Miasto  Pensja
0        Jan    28  Warszawa    5000
1       Anna    34    Kraków    6200
2      Piotr    26    Gdańsk    4800
3      Maria    40  Warszawa    5200
4  Krzysztof    22    Poznań    4500

In [10]:
with pd.ExcelWriter("dane/wiele_arkuszy.xlsx", mode='a') as writer:
    df_b.to_excel(writer, sheet_name='nowy_arkusz_2')